# Pandas seririsi oluşturmak

In [1]:
import pandas as pd

In [4]:
seri=pd.Series([1,77,3,51,5])

In [6]:
type(seri)

pandas.core.series.Series

In [7]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [8]:
seri.dtype

dtype('int64')

In [11]:
seri.size# eleman sayısı

5

In [12]:
seri.ndim # boyutu

1

In [13]:
seri.values

array([ 1, 77,  3, 51,  5], dtype=int64)

In [14]:
seri.head(3)

0     1
1    77
2     3
dtype: int64

In [15]:
seri.tail(3)

2     3
3    51
4     5
dtype: int64

In [16]:
# index isimlendirmesi

In [18]:
pd.Series([99,22,432,423556,765])

0        99
1        22
2       432
3    423556
4       765
dtype: int64

In [20]:
pd.Series([99,22,432,423556,765],index=[1,3,5,7,9])

1        99
3        22
5       432
7    423556
9       765
dtype: int64

In [24]:
pd.Series([99,22,432,456,765],index=["a","b","c","d","e"])

a     99
b     22
c    432
d    456
e    765
dtype: int64

In [25]:
seri=pd.Series([99,22,432,456,765],index=["a","b","c","d","e"])

In [27]:
seri["c"]

432

In [28]:
seri["a":"c"]

a     99
b     22
c    432
dtype: int64

In [32]:
seri=pd.Series([99,22,432,423556,765])

In [33]:
seri[0:3]

0     99
1     22
2    432
dtype: int64

In [34]:
# Sozluk üzerinden liste oluşturmak

In [36]:
sozluk=pd.Series({"reg":10,"log":11,"cart":12})

In [37]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [38]:
sozluk={"reg":10,"log":11,"cart":12}

In [39]:
seri=pd.Series(sozluk)

In [40]:
seri

reg     10
log     11
cart    12
dtype: int64

In [41]:
# iki seriyi birleştirerek seri oluşturma

In [46]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Eleman işlemleri

In [47]:
import numpy as np
import pandas as pd
a=np.array([13,42,1,325,5,7])
seri=pd.Series(a)

In [48]:
seri

0     13
1     42
2      1
3    325
4      5
5      7
dtype: int32

In [50]:
seri[0]

13

In [51]:
seri[0:3]

0    13
1    42
2     1
dtype: int32

In [56]:
seri = pd.Series([123,34,453,65],
                 index=["reg","loj","cart","rf"])
seri

reg     123
loj      34
cart    453
rf       65
dtype: int64

In [57]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [59]:
seri.keys

<bound method Series.keys of reg     123
loj      34
cart    453
rf       65
dtype: int64>

In [60]:
list(seri.items())

[('reg', 123), ('loj', 34), ('cart', 453), ('rf', 65)]

In [61]:
seri.values

array([123,  34, 453,  65], dtype=int64)

In [62]:
# eleman sorgulama

In [63]:
"reg" in seri

True

In [64]:
"A" in seri

False

In [66]:
seri["reg"]

123

In [70]:
# fancy eleman
seri

reg     123
loj      34
cart    453
rf       65
dtype: int64

In [69]:
seri[["rf","reg"]]

rf      65
reg    123
dtype: int64

In [71]:
seri["reg"]=155

In [72]:
seri["reg"]

155

In [73]:
seri["reg":"loj"]

reg    155
loj     34
dtype: int64

# Pandas DataFrame Olusturma

In [74]:
import pandas as pd
l=[1,2,32,43,20]
l

[1, 2, 32, 43, 20]

In [76]:
pd.DataFrame(l,columns=["veriable_name"])

   veriable_name
0              1
1              2
2             32
3             43
4             20

In [79]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [81]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [90]:
pd.DataFrame(m,columns=["var1","var2","var3"],index=("a","b","c"))

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [91]:
# Df isimlendirme

In [85]:
Df=pd.DataFrame(m,columns=["var1","var2","var3"])
Df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [86]:
Df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [93]:
Df.columns=("a","b","c")
Df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [96]:
type(Df)

pandas.core.frame.DataFrame

In [97]:
Df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['a', 'b', 'c'], dtype='object')]

In [99]:
Df.shape# boyut bilgisi

(3, 3)

In [102]:
Df.ndim # pandas DataFramelerde her zaman 2 olarak gelir.

2

In [103]:
Df.size

9

In [104]:
Df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [106]:
type(Df.values) #numpy arrayine çevirlmis

numpy.ndarray

In [114]:
Df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [112]:
Df.head(2)

   a  b  c
0  1  2  3
1  4  5  6

In [115]:
Df.tail(1)

   a  b  c
2  7  8  9

In [116]:
a=np.array([1,2,3,4,5])

In [117]:
pd.DataFrame(a)

   0
0  1
1  2
2  3
3  4
4  5

In [120]:
pd.DataFrame(a,columns=["deg1"],index=["a","b","c","d","e"])

   deg1
a     1
b     2
c     3
d     4
e     5

# Pandas DataFrameleri İçin Eleman islemleri

In [149]:
import numpy as np
import pandas as pd
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [150]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [151]:
sozluk

{'var1': array([5, 7, 2, 5, 0]),
 'var2': array([2, 0, 9, 3, 9]),
 'var3': array([4, 6, 4, 3, 1])}

In [152]:
Df=pd.DataFrame(sozluk)
Df

   var1  var2  var3
0     5     2     4
1     7     0     6
2     2     9     4
3     5     3     3
4     0     9     1

In [153]:
Df[0:3]

   var1  var2  var3
0     5     2     4
1     7     0     6
2     2     9     4

In [154]:
Df.index=["a","b","c","d","e"]
Df

   var1  var2  var3
a     5     2     4
b     7     0     6
c     2     9     4
d     5     3     3
e     0     9     1

In [155]:
Df["a":"c"]

   var1  var2  var3
a     5     2     4
b     7     0     6
c     2     9     4

In [156]:
# Silme

In [157]:
Df.drop("a",axis=0)

   var1  var2  var3
b     7     0     6
c     2     9     4
d     5     3     3
e     0     9     1

In [158]:
Df

   var1  var2  var3
a     5     2     4
b     7     0     6
c     2     9     4
d     5     3     3
e     0     9     1

In [159]:
Df.drop("b",axis=0,inplace=True)

In [160]:
Df

   var1  var2  var3
a     5     2     4
c     2     9     4
d     5     3     3
e     0     9     1

In [161]:
# fancy silme

In [171]:
l=["c","e"]

In [172]:
Df.drop(l,axis=0)

   var1  var2  var3
a     5     2     4
d     5     3     3

In [173]:
# degiskenler icin

In [177]:
"var1" in Df

True

In [181]:
l=["var1","var4","var3"]

In [182]:
for i in l:
    print(i in Df)

True
False
True

In [183]:
Df

   var1  var2  var3
a     5     2     4
c     2     9     4
d     5     3     3
e     0     9     1

In [184]:
Df["var4"]=Df["var1"]/Df["var2"]

In [185]:
Df

   var1  var2  var3      var4
a     5     2     4  2.500000
c     2     9     4  0.222222
d     5     3     3  1.666667
e     0     9     1  0.000000

In [186]:
# degisken silmek

In [188]:
Df.drop("var4",axis=1)

   var1  var2  var3
a     5     2     4
c     2     9     4
d     5     3     3
e     0     9     1

In [189]:
Df

   var1  var2  var3      var4
a     5     2     4  2.500000
c     2     9     4  0.222222
d     5     3     3  1.666667
e     0     9     1  0.000000

In [190]:
Df.drop("var4",axis=1,inplace=True)

In [191]:
Df

   var1  var2  var3
a     5     2     4
c     2     9     4
d     5     3     3
e     0     9     1

In [199]:
l=["var1","var2"]

In [200]:
Df.drop(l,axis=1)

   var3
a     4
c     4
d     3
e     1

In [201]:
Df

   var1  var2  var3
a     5     2     4
c     2     9     4
d     5     3     3
e     0     9     1

# Gozlem ve Degisken secimi: loc & iloc

In [203]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
Df=pd.DataFrame(m,columns=["var1","var2","var3"])
Df

   var1  var2  var3
0    23     6    18
1     1     5    21
2     9     9    19
3    28    15     9
4    28     5    22
5     9    13    17
6    21    29     1
7     2    22    10
8     2     5    14
9     1    24    29

In [205]:
# loc : tanımlandıgı sekliyle secim yapmak icin kullanilir.

In [206]:
Df.loc[0:3]

   var1  var2  var3
0    23     6    18
1     1     5    21
2     9     9    19
3    28    15     9

In [207]:
# iloc: alısık oldugumuz indeksleme mantigi ile secim yapar.

In [208]:
Df.iloc[0:3]

   var1  var2  var3
0    23     6    18
1     1     5    21
2     9     9    19

In [209]:
Df.iloc[:3,:2]

   var1  var2
0    23     6
1     1     5
2     9     9

In [212]:
Df.loc[:3,:"var3"]

   var1  var2  var3
0    23     6    18
1     1     5    21
2     9     9    19
3    28    15     9

In [219]:
Df.loc[0:3,"var3"]# iloc kullanırken "var3" gibi indixleri giremiyoruz sayı olmak zorunda. Df.iloc[0:3]["var3"] anca böyle  oluyuyor.

0    18
1    21
2    19
3     9
Name: var3, dtype: int32

# Kosullu Eleman islemleri

In [220]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
Df=pd.DataFrame(m,columns=["var1","var2","var3"])
Df

   var1  var2  var3
0    14    18     9
1    16    12    24
2    15     8     9
3    29    14    16
4    28    14    28
5     1    11    24
6     3    25    10
7    16    12    16
8     7    26    23
9    19    13    21

In [221]:
Df["var1"]

0    14
1    16
2    15
3    29
4    28
5     1
6     3
7    16
8     7
9    19
Name: var1, dtype: int32

In [222]:
Df[:2]["var2"]

0    18
1    12
Name: var2, dtype: int32

In [230]:
l=["var2","var3"]

In [231]:
Df[:2][l]

   var2  var3
0    18     9
1    12    24

In [233]:
Df.var1

0    14
1    16
2    15
3    29
4    28
5     1
6     3
7    16
8     7
9    19
Name: var1, dtype: int32

In [238]:
Df[Df.var1>15]["var1"]

1    16
3    29
4    28
7    16
9    19
Name: var1, dtype: int32

In [244]:
Df[(Df.var1>15)&(Df.var3<20)]

   var1  var2  var3
3    29    14    16
7    16    12    16

In [247]:
Df.loc[(Df.var1>15),["var1","var2"]]# loc yazilir.

   var1  var2
1    16    12
3    29    14
4    28    14
7    16    12
9    19    13

In [250]:
Df[Df.var1>15][["var1","var2"]] # Bu sekilde de yapilabilir.

   var1  var2
1    16    12
3    29    14
4    28    14
7    16    12
9    19    13

# Birlestirme(Join) islemleri

In [253]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(5,3))
Df1=pd.DataFrame(m,columns=["var1","var2","var3"])
Df1

   var1  var2  var3
0    22    12    11
1    14    25     9
2     4     6     6
3     3     2    20
4    13    24     6

In [254]:
Df2=Df1+99
Df2

   var1  var2  var3
0   121   111   110
1   113   124   108
2   103   105   105
3   102   101   119
4   112   123   105

In [255]:
pd.concat([Df1,Df2])

   var1  var2  var3
0    22    12    11
1    14    25     9
2     4     6     6
3     3     2    20
4    13    24     6
0   121   111   110
1   113   124   108
2   103   105   105
3   102   101   119
4   112   123   105

In [257]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\yahya\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [258]:
pd.concat([Df1,Df2],ignore_index=True)

   var1  var2  var3
0    22    12    11
1    14    25     9
2     4     6     6
3     3     2    20
4    13    24     6
5   121   111   110
6   113   124   108
7   103   105   105
8   102   101   119
9   112   123   105

In [260]:
Df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [261]:
Df2.columns=["var1","var2","deg3"]

In [262]:
Df2

   var1  var2  deg3
0   121   111   110
1   113   124   108
2   103   105   105
3   102   101   119
4   112   123   105

In [269]:
Df1

   var1  var2  var3
0    22    12    11
1    14    25     9
2     4     6     6
3     3     2    20
4    13    24     6

In [270]:
pd.concat([Df1,Df2])

   var1  var2  var3   deg3
0    22    12  11.0    NaN
1    14    25   9.0    NaN
2     4     6   6.0    NaN
3     3     2  20.0    NaN
4    13    24   6.0    NaN
0   121   111   NaN  110.0
1   113   124   NaN  108.0
2   103   105   NaN  105.0
3   102   101   NaN  119.0
4   112   123   NaN  105.0

In [272]:
pd.concat([Df1,Df2],join="inner") # kesisimlerine gore birlestirdi.

   var1  var2
0    22    12
1    14    25
2     4     6
3     3     2
4    13    24
0   121   111
1   113   124
2   103   105
3   102   101
4   112   123

In [309]:
#pd.concat([Df1,Df2]).reindex(Df2.columns)# pandastan kaldirilmis ozellik.

# İleri Birlestirme Yontemleri

In [310]:
import pandas as pd

In [312]:
#Birebir birlestirme.

In [318]:
Df1=pd.DataFrame({'calisanlar':
                  ["Ali","veli","Ayse","Fatma"],
                  'grup':
                  ["Muhasebe","Muhendislik","Muhendislik","Ik"]})
Df1

  calisanlar         grup
0        Ali     Muhasebe
1       veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           Ik

In [319]:
Df2=pd.DataFrame({'calisanlar':
                  ["Ali","veli","Ayse","Fatma"],
                  'ilk giris':
                  [2010,2009,2014,2019]})
Df2

  calisanlar  ilk giris
0        Ali       2010
1       veli       2009
2       Ayse       2014
3      Fatma       2019

In [320]:
pd.concat([Df1,Df2]) # birebir olmuyor.

  calisanlar         grup  ilk giris
0        Ali     Muhasebe        NaN
1       veli  Muhendislik        NaN
2       Ayse  Muhendislik        NaN
3      Fatma           Ik        NaN
0        Ali          NaN     2010.0
1       veli          NaN     2009.0
2       Ayse          NaN     2014.0
3      Fatma          NaN     2019.0

In [321]:
pd.merge(Df1,Df2)

  calisanlar         grup  ilk giris
0        Ali     Muhasebe       2010
1       veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [322]:
pd.merge(Df1,Df2,on="calisanlar")

  calisanlar         grup  ilk giris
0        Ali     Muhasebe       2010
1       veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [323]:
# coktan teke

In [324]:
Df3=pd.merge(Df1,Df2)

In [325]:
Df3

  calisanlar         grup  ilk giris
0        Ali     Muhasebe       2010
1       veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           Ik       2019

In [328]:
Df4=pd.DataFrame({'grup':["Muhasebe","Muhendislik","Ik"],
                  "mudur":["Caner","Mustafa","Berkcan"]})
Df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           Ik  Berkcan

In [330]:
pd.merge(Df3,Df4)

  calisanlar         grup  ilk giris    mudur
0        Ali     Muhasebe       2010    Caner
1       veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           Ik       2019  Berkcan

In [331]:
# coktan coka

In [332]:
Df5=pd.DataFrame({"grup":["Muhasebe","Muhasebe",
                          "Muhendislik","Muhendislik","IK","IK"],
                  "yetenekler":["Matematik","excel","kodlama",
                                "linux","exel","yonetim"]})
Df5

          grup yetenekler
0     Muhasebe  Matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK       exel
5           IK    yonetim

In [333]:
Df1

  calisanlar         grup
0        Ali     Muhasebe
1       veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           Ik

In [334]:
pd.merge(Df1,Df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      excel
2       veli  Muhendislik    kodlama
3       veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux

# Toplulastırma ve Gruplama
# (Aggregation & Grouping)

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* max()
* std()
* var()
* sum()

In [342]:
import seaborn as sns

In [343]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\yahya\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [389]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [356]:
df.shape

(1035, 6)

In [357]:
df.size

6210

In [358]:
df.mean()

C:\Users\yahya\AppData\Local\Temp\ipykernel_31104\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [359]:
df["year"].mean()

2009.0705314009663

In [370]:
df["year"].min()

1989

In [367]:
df["year"].max()

2014

In [373]:
df["year"].sum()

2079388

In [383]:
df["year"].std()# standart sapması.

3.9725668572022177

In [384]:
df["year"].var()

15.781287434941506

In [385]:
df["year"].count()

1035

In [387]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [391]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama islemleri

In [404]:
import pandas as pd
import seaborn as sns
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "veri":[10,21,32,15,51,44]},
                columns=["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    21
2       C    32
3       A    15
4       B    51
5       C    44

In [401]:
df.groupby("gruplar")# gruplari yakalayip arakda nesne olusturmustur

In [402]:
df.groupby("gruplar").mean()

         veri
gruplar
A        12.5
B        36.0
C        38.0

In [403]:
df.groupby("gruplar").sum()

         veri
gruplar
A          25
B          72
C          76

In [405]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [408]:
df.groupby("method")

In [409]:
df.groupby("method")["orbital_period"]

In [410]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [412]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [413]:
df.dropna().groupby("method")["mass"].mean()

method
Radial Velocity    2.511411
Transit            1.470000
Name: mass, dtype: float64

In [415]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# Ileri Toplulastirma islemleri(Aggregate,filter,transform,apply)

In [424]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "degisken1":[10,21,32,15,51,44],
                 "degisken2":[100,121,532,165,351,744]},
                columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         21        121
2       C         32        532
3       A         15        165
4       B         51        351
5       C         44        744

## aggregate

In [422]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             12.5      132.5
B             36.0      236.0
C             38.0      638.0

In [423]:
df.groupby("gruplar").aggregate(["min",np.median,"max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   12.5  15       100  132.5  165
B              21   36.0  51       121  236.0  351
C              32   38.0  44       532  638.0  744

In [425]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        165
B               21        351
C               32        744

##  filter

In [427]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "degisken1":[10,21,32,15,51,44],
                 "degisken2":[100,121,532,165,351,744]},
                columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         21        121
2       C         32        532
3       A         15        165
4       B         51        351
5       C         44        744

In [433]:
def filter_func(x):
    return x["degisken1"].std()>9

In [435]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         3.535534   45.961941
B        21.213203  162.634560
C         8.485281  149.906638

In [434]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
1       B         21        121
4       B         51        351

## transform

In [441]:
df["degisken1"]*9

0     90
1    189
2    288
3    135
4    459
5    396
Name: degisken1, dtype: int64

In [466]:
df_a = df.iloc[:,1:3]    # df.loc[:,"degisken1":"degisken2"]

In [469]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0 -18.833333     -235.5
1  -7.833333     -214.5
2   3.166667      196.5
3 -13.833333     -170.5
4  22.166667       15.5
5  15.166667      408.5

In [470]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -1.150930  -0.908102
1  -0.478705  -0.827125
2   0.193519   0.757716
3  -0.845373  -0.657458
4   1.354635   0.059769
5   0.926855   1.575201

## apply

In [480]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                 "degisken1":[10,21,32,15,51,44],
                 "degisken2":[100,121,532,165,351,744]},
                columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         21        121
2       C         32        532
3       A         15        165
4       B         51        351
5       C         44        744

In [481]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       173
degisken2      2013
dtype: object

In [484]:
df.apply(np.mean)

TypeError: Could not convert ABCABC to numeric

In [486]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         25        265
B            BB         72        472
C            CC         76       1276

In [487]:
df.groupby("gruplar").apply(np.mean)

C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000019F030977F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000019F030977F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\yahya\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x0000019F030977F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             12.5      132.5
B             36.0      236.0
C             38.0      638.0

# Pivot Tablolar

In [490]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [494]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [495]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [497]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [499]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [498]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [500]:
# pivot ile table

In [501]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [508]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [516]:
age=pd.cut(titanic["age"],[0,18,30,60,90])
age.head(10)

0    (18.0, 30.0]
1    (30.0, 60.0]
2    (18.0, 30.0]
3    (30.0, 60.0]
4    (30.0, 60.0]
5             NaN
6    (30.0, 60.0]
7     (0.0, 18.0]
8    (18.0, 30.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (4, interval[int64, right]): [(0, 18] < (18, 30] < (30, 60] < (60, 90]]

In [526]:
titanic.pivot_table("survived",["sex",age],"class") # otamtik olarak func mean tanimli.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 30]  0.958333  0.900000  0.500000
       (30, 60]  0.979167  0.900000  0.272727
       (60, 90]  1.000000       NaN  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 30]  0.428571  0.027027  0.147541
       (30, 60]  0.412698  0.090909  0.118421
       (60, 90]  0.083333  0.333333  0.000000

In [524]:
?pd.pivot_table

Signature:
pd.pivot_table(
    data: 'DataFrame',
    values=None,
    index=None,
    columns=None,
    aggfunc: 'AggFuncType' = 'mean',
    fill_value=None,
    margins: 'bool' = False,
    dropna: 'bool' = True,
    margins_name: 'str' = 'All',
    observed: 'bool' = False,
    sort: 'bool' = True,
) -> 'DataFrame'
Docstring:
Create a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in MultiIndex objects
(hierarchical indexes) on the index and columns of the result DataFrame.

Parameters
----------
data : DataFrame
values : column to aggregate, optional
index : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table index.  If an array is passed,
    it is being used as the same manner as column values.
columns : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table column.  If an array is passed,
    it is being used as the same manner as column values.
aggfunc : function, list of functions, dict, default numpy.mean
    If list of functions passed, the resulting pivot table will have
    hierarchical columns whose top level are the function names
    (inferred from the function objects themselves)
    If dict is passed, the key is column to aggregate and value
    is function or list of functions.
fill_value : scalar, default None
    Value to replace missing values with (in the resulting pivot table,
    after aggregation).
margins : bool, default False
    Add all row / columns (e.g. for subtotal / grand totals).
dropna : bool, default True
    Do not include columns whose entries are all NaN. If True,
    rows with a NaN value in any column will be omitted before
    computing margins.
margins_name : str, default 'All'
    Name of the row / column that will contain the totals
    when margins is True.
observed : bool, default False
    This only applies if any of the groupers are Categoricals.
    If True: only show observed values for categorical groupers.
    If False: show all values for categorical groupers.

    .. versionchanged:: 0.25.0

sort : bool, default True
    Specifies if the result should be sorted.

    .. versionadded:: 1.3.0

Returns
-------
DataFrame
    An Excel style pivot table.

See Also
--------
DataFrame.pivot : Pivot without aggregation that can handle
    non-numeric data.
DataFrame.melt: Unpivot a DataFrame from wide to long format,
    optionally leaving identifiers set.
wide_to_long : Wide panel to long format. Less flexible but more
    user-friendly than melt.

Notes
-----
Reference :ref:`the user guide <reshaping.pivot>` for more examples.

Examples
--------
>>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
>>> df
     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

This first example aggregates values by taking the sum.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum)
>>> table
C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

We can also fill missing values using the `fill_value` parameter.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum, fill_value=0)
>>> table
C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

The next example aggregates by taking the mean across multiple columns.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': np.mean})
>>> table
                D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

We can also calculate multiple types of aggregations for any given
value column.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': [min, max, np.mean]})
>>> table
                  D   E
               mean max      mean  min
A   C
bar large  5.500000   9  7.500000    6
    small  5.500000   9  8.500000    8
foo large  2.000000   5  4.500000    4
    small  2.333333   6  4.333333    2
File:      c:\users\yahya\anaconda3\lib\site-packages\pandas\core\reshape\pivot.py
Type:      function

# Dıs Kaynakli Veri Okuma.

In [527]:
import pandas as pd

In [532]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols=None,
    squeeze: 'bool | None' = None,
    prefix: 'str | lib.NoDefault' = <no_default>,
    mangle_dupe_cols: 'bool' = True,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace: 'bool' = False,
    skiprows=None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values=None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool' = False,
    skip_blank_lines: 'bool' = True,
    parse_dates=None,
    infer_datetime_format: 'bool' = False,
    keep_date_col: 'bool' = False,
    date_parser=None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    error_bad_lines: 'bool | None' = None,
    warn_bad_lines: 'bool | None' = None,
    on_bad_lines=None,
    delim_whitespace: 'bool' = False,
    low_memory=True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions' = None,
) -> 'DataFrame | TextFileReader'
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, None, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, optional, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.

    .. deprecated:: 1.4.0
        Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
        the data.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

    .. deprecated:: 1.4.0
       Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.

    .. deprecated:: 1.5.0
        Not implemented, and a new argument to specify the pattern for the
        names of duplicated columns will be added instead
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.

    .. versionadded:: 1.5.0

        Support for defaultdict was added. Specify a defaultdict as input where
        the default determines the dtype of the columns which are not explicitly
        listed.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The "pyarrow" engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'tar'``} and other
    key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.

    .. versionchanged:: 1.3.0

       ``encoding_errors`` is a new argument. ``encoding`` has no longer an
       influence on how encoding errors are handled.

encoding_errors : str, optional, default "strict"
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, optional, default ``None``
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will be dropped from the DataFrame that is
    returned.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
warn_bad_lines : bool, optional, default ``None``
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

        - 'error', raise an Exception when a bad line is encountered.
        - 'warn', raise a warning when a bad line is encountered and skip that line.
        - 'skip', skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new list of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine="python"``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this

In [530]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [531]:
#text okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [536]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [537]:
df=pd.read_excel("reading_data/ornekx.xlsx")

In [538]:
type(df)

pandas.core.frame.DataFrame

In [539]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [542]:
df.columns=("A","B","C")
df.head()

    A    B    C
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [545]:
# sifirdan txt okuma

fd=pd.read_csv("reading_data/tips.txt")
fd.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# Bonus: Problem cozme ve dokuman okuma kulturu

In [549]:
#cheatsheet ve ? yontemleri

In [550]:
#Stack Overflow

In [551]:
#documentation

In [552]:
# %95 okuma  %5 kodlama